const dataJS = [
  // {
  //   name: '應用設備',
  //   show: true,
  //   comId: 'TextVue',
  //   list: [
  //     { value: '用18G盤縫' },
  //     { value: '用16G縫盤' },
  //   ],
  //   marksList: []
  // },
  //   {
  //   name: '應用設備',
  //   show: true,
  //   comId: 'TextVue',
  //   list: [
  //     { value: '用18G盤縫' },
  //     { value: '用16G縫盤' },
  //   ],
  //   marksList: []
  // },
  //   {
  //   name: '應用設備',
  //   show: true,
  //   comId: 'TextVue',
  //   list: [
  //     { value: '用18G盤縫' },
  //     { value: '用16G縫盤' },
  //   ],
  //   marksList: []
  // },
  //   {
  //   name: '應用設備',
  //   show: true,
  //   comId: 'TextVue',
  //   list: [
  //     { value: '用18G盤縫' },
  //     { value: '用16G縫盤' },
  //   ],
  //   marksList: []
  // },
  //   {
  //   name: '應用設備',
  //   show: true,
  //   comId: 'TextVue',
  //   list: [
  //     { value: '用18G盤縫' },
  //     { value: '用16G縫盤' },
  //   ],
  //   marksList: []
  // },

  // 應用設備
  {
    name: '應用設備',
    show: true,
    comId: 'TextVue',
    list: [
      { value: '用18G盤縫' },
      { value: '用16G縫盤' },
      { value: '用8G縫盤' },
      { value: '用6G縫盤' },
      { value: '用10G縫盤' },
      { value: '上领用12G盘缝,其余用16G縫盤' },
      { value: '鎖眼用12G縫盤，其餘用16G縫盤' },
      { value: '鎖眼用8G縫盤，其餘用6G縫盤' },
      { value: '鎖眼用6G縫盤，其餘用8G縫盤' },
      { value: '鎖眼用16G縫盤，其餘用18G縫盤' },
      { value: '衬片鎖眼用8G縫盤，倒三角布锁眼及上领上衬脚/袖咀及埋衬脚/袖咀用16G盘缝,其餘用10G縫盤' },
    ],
    marksList: []
  },
  // 煙紙落法
  {
    name: '煙紙落法',
    show: true,
    comId: 'TextVue',
    list: [
      { value: '穿起計右邊腳頂上5寸落煙紙' },
      { value: '穿起計左邊腳頂上5寸落煙紙' },
      { value: '穿起計右邊后夾落煙紙，用埋夾車埋夾' },
      { value: '穿起計右邊后夾落煙紙，要拆夹车三角线' },
      { value: '因此批只有一個碼，不用落煙紙' },
      { value: '縫穿起計右邊前袋貼面層落煙紙' },
    ],
    marksList: []

  },
  // 縫線用法
  {
    name: '縫線用法',
    show: true,
    comId: 'TextVue',
    list: [
      { value: '用2條A色原身毛縫' },
      { value: '用2条原身毛缝' },
      { value: '用1条A色原身毛加2条70DX2尼龙加捻缝' },
      { value: '用3条原身毛缝' },
      { value: '用1條原身毛縫' },
      { value: '用1條A色原身毛加2條70DX2尼龍加捻縫' },
      { value: '用4条A色原身毛加捻缝' },
      { value: '用配毛缝(即配A色缝)' },
      { value: '上領用1條A色原身毛加1條70DX2尼龍加捻縫，其餘用1條A色原身毛加2條70DX2尼龍加捻縫' },
      { value: '上領用2條B色原身毛縫，其餘用2條B色原身毛加1條70DX2尼龍加捻縫' },
      { value: '前V加辫子用2条B色原身毛缝，其余用2条B色原身毛加2条70DX2尼龙加捻缝' },
      { value: '领顶锁眼用4条配色70DX2尼龙加捻缝，其余用2条原身毛加1条70DX2尼龙加捻缝' },
      { value: '用1条原身毛加2条70DX2尼龙加捻缝' },
      { value: '倒三角布锁眼/上领/上衫脚/袖咀及埋衫脚/袖咀用1条原身毛加1条70DX2尼龙加捻缝' },
      { value: '领顶锁眼用4条70DX2尼龙加捻缝，其余用1条原身毛加1条70DX2尼龙加捻缝' },
      { value: 'A/B/C色各用4条原身毛缝，上袖前夹跟色换回原色毛缝，其余用A色毛缝' },
      { value: '上领/盖后领贴用2条净A色原身毛缝，其余用2条A色原身毛加70DX2尼龙加捻缝' },
      { value: 'A色用2条原身毛加1条70DX2尼龙加捻缝E色用3条原身毛加1条70DX2尼龙加捻缝，上袖用E色毛缝，其余用A色毛缝，详情用毛如原办' },
      { value: 'A/B色用5条原身毛缝，全件跟色换回原色毛缝，上胸贴用 胸贴色毛缝，胸贴埋咀及上领用领色' },
    ],
    marksList: []

  },
  // 鎖眼
  {
    name: '鎖眼',
    show: true,
    comId: 'TextVue',
    list: [
      { value: '全件套针' },
      { value: '前后膊、袖尾及前后幅领位锁过梳上1行(即单边第1行)' },
      { value: '袋布、前膊、袖尾及后幅领位锁过梳上1行(即单边第1行)' },
      { value: '袖尾及前后幅领位锁过梳上1行(即单边第1行)' },
      { value: '前幅锁过梳上1行(即单边第1行)后幅锁连纱2行，袖尾锁铲针上1行' },
      { value: '前后膊、袖尾及后幅领位锁过梳上1行(即单边第1行)' },
      { value: '前后膊、袖尾及后幅领位锁过梳上1行(即单边第1行)' },
      { value: '袖尾锁过梳上1行(即单边第1行)膊位套针' },
      { value: '前后幅锁过梳上1行(即单边第1行)袋布针针笠眼铲针上1行缝暗骨' },
      { value: '领顶锁松眼行，其余套针' },
      { value: '前后膊、袖尾及前后幅领位锁过梳上1行(即单边第1行)前后幅领位锁过无边花位4/8寸' },
      { value: '前膊锁连纱2行，袖尾及前后幅领位锁铲针上1行，倒三角锁过梳上1行(即单边第1行)' },
      { value: '前后领顶锁过梳行' },
      { value: '后幅领位锁铲针上1行' },
    ],
    table: [
      {
        name: '领顶锁眼线出盘双拉',
        0: '14-3/8',
        1: '14-3/8',
        2: '14-6/8',
        3: '15-1/8',
        4: '14-3/8',
        5: '14-3/8',
        6: '14-6/8',
      },
      {
        name: '袖尾锁眼线出盘拉',
        0: '',
        1: '4-6/8',
        2: '4-6/8',
        3: '5寸',
        4: '5-2/8',
        5: '5-2/8',
        6: '',
      },
      {
        name: '后领锁眼线出盘拉',
        0: '',
        1: '',
        2: '14-3/8',
        3: '14-3/8',
        4: '14-6/8',
        5: '15-/8',
        6: '',
      }
    ],
    // tableHeader: [],
    // table: [],
    tableHeader: ['XXS', 'XS', 'S', 'M', 'L', 'XL', 'XXL'],
    diaLogId: 'TableDialogVue',
    marksList: []

  },
  // 納膊
  {
    name: '納膊',
    show: true,
    comId: 'TextVue',
    list: [
      { value: '前膊缝套针下1行，后膊从收针位开始缝后膊缝好花出10支边' },
      { value: '前后膊顺着铲针位斜顺对坑缝，止口不可太大，膊夹边5支要拉开缝' },
      { value: '前后膊顺着铲针位斜顺对支缝，止口不可太大，膊夹边5支要拉开缝' },
      { value: '前膊缝套针下1行，后膊从收针位开始缝，后膊缝好花出6支边' },
      { value: '前后膊缝锁眼眼线下1行头尾对支缝' },
      { value: '前后膊顺着铲针位斜顺头尾对支缝，止口不可太大，膊夹边2支底穿2针' },
      { value: '前膊缝锁眼线下1行，后膊顺着无边斜顺缝，止口不可太大' },
      { value: '前后膊顺着铲针斜头尾对支缝，止口不可太大，膊夹边5支要拉开缝，领位刮1支半冚1支半缝好花出1坑面' },
      { value: '后膊缝套针下1行，前膊从记号位开始缝，前膊顺便刮3支边倒边刮2支半缝好花6支面' },
      { value: '前后膊顺着铲针位斜顺头尾对坑缝，止口不可太大，不要加膊带，膊夹边5支要拉开缝' },
      { value: '前膊缝套针下2行，后膊顺着无边斜顺缝，止口不可太大' },

    ],
    table: [
      {
        name: '膊上盘:',
        0: '',
        1: '2-5/8',
        2: '2-5/8',
        3: '2-5/8',
        4: '2-5/8',
        5: '2-5/8',
        6: '',
      },
      {
        name: '出盘拉:',
        0: '',
        1: '3-6/8',
        2: '3-6/8',
        3: '3-6/8',
        4: '3-6/8',
        5: '3-6/8',
        6: '',
      },
      {
        name: '袖尾落纱位上:',
        0: '',
        1: '3-3/8',
        2: '3-3/8',
        3: '3-5/8',
        4: '3-6/8',
        5: '3-6/8',
        6: '',
      },
      {
        name: '不连脚出盘拉:',
        0: '',
        1: '24-6/8',
        2: '25-7/8',
        3: '25-7/8',
        4: '25-7/8',
        5: '25-7/8',
        6: '',
      },
      {
        name: '袖尾上:',
        0: '',
        1: '',
        2: '',
        3: '',
        4: '',
        5: '',
        6: '6寸',
      },
      {
        name: '袖夹底不连脚上:',
        0: '',
        1: '19-5/8',
        2: '19-5/8',
        3: '19-6/8',
        4: '19-7/8',
        5: '19-7/8',
        6: '',
      }
    ],
    // table: [],
    // tableHeader: [],
    tableHeader: ['XXS', 'XS', 'S', 'M', 'L', 'XL', 'XXL'],
    diaLogId: 'TableDialogVue',
    marksList: []
  },
  // 齊碼衫腳、袖咀上
  {
    name: '齊碼衫腳、袖咀上',
    show: true,
    comId: 'TextVue',
    list: [
      { value: '3寸，出盤啦：4寸' },
      { value: '上領用1條A色原身毛加1條70DX2尼龍加捻縫，其餘用1條A色原身毛加2條70DX2尼龍加捻縫' },
      { value: '用1條原身毛縫' },
    ],
    marksList: []

  },
  // 上袖、埋夾
  {
    name: '上袖、埋夾',
    show: true,
    comId: 'TextVue',
    list: [
      { value: '上袖套針位針針穿，刮2支2支邊，袖夾到邊刮2支半，前幅幾號位對袖尾最後一個無邊花并轉元角，另一邊修為套針位' },
      { value: '上袖套针位针针穿，刮2支冚2支边，袖夹倒边刮2支半，前后幅记号位对袖尾最后一个无边花并轉元角，袖尾中记号过前幅3支' },
      { value: '上袖套针位针针穿，刮2支冚2支边，袖夹倒边刮2支半，前后幅记号位对袖尾最后一个无边花并轉元角，袖尾记号，一个对膊骨，另一个过前幅，袖尾中记号对枪记号缝' },
      { value: '上袖套針位針对齐缝，刮2支冚2支邊，袖夾与前后加对齐缝' },
      { value: '前后夹从套针位开始缝，前后夹刮2支边袖尾顺着铲针位斜顺缝，袖尾中挑吼过前幅3支袖尾边挑吼对前后加记号位缝' },
      { value: '上袖套針位針对齐缝，前后加挂刮2支边袖夹刮1支边，前后幅记号位对袖尾最后一个无边花并轉元角，袖尾中记号过前幅2支' },
      { value: '前后夹从直位开始缝，前后夹刮2支边袖夹缝锁眼线下1行，袖尾边挑吼对前后夹记号缝袖尾中吼过前幅1支' },
      { value: '上袖套針位針针穿缝套针下2行，刮2支冚2支邊，袖夹倒边刮2支半，前幅记号位针袖尾最后一个无边花并轉元角，另一边袖尾套针第1支对膊骨并轉元角' },

    ],
    marksList: []

  },
  // 埋夾
  {
    name: '埋夾',
    show: true,
    comId: 'TextVue',
    list: [
      { value: '刮2支2支邊，加針位及袖夾底刮順頭尾對，衫腳、袖咀刮2支半2只半' },
      { value: '刮2支冚2支边对记号缝，袖夹底刮顺对坑缝，衫脚，袖咀刮2支半冚2支半' },
      { value: '刮2支冚2支面，袖夹底刮顺头尾对衫脚，袖咀刮2支冚2支面' },
      { value: '刮2支冚2支边，袖底底刮2支半冚1支半衫脚至加针位开叉不缝，袖咀刮2支冚1半' },
      { value: '刮2支冚1支边，袖夹底刮顺对支缝，衫脚、袖咀刮1支半冚1支半' },
      { value: '刮2支冚2支边，加针位及袖夹底刮顺头尾对，衫脚、袖咀刮2支半冚2支半' },
      { value: '帽身刮1支半冚1支半对花位缝，帽脚至帽身记号用手撞' },

    ],
    marksList: []

  }
];

export default dataJS;
