const dataJS = {
  tableList: [
    {
      table: [
        {
          name: '前平X2:',
          0: '14-3/8',
          1: '14-3/8',
          2: '14-6/8',
          3: '15-1/8',
          4: '14-3/8',
          5: '14-3/8',
          6: '14-6/8',
        },
        {
          name: '铲针位X2:',
          0: '14-3/8',
          1: '14-3/8',
          2: '14-6/8',
          3: '15-1/8',
          4: '14-3/8',
          5: '14-3/8',
          6: '14-6/8',
        },
        {
          name: '前斜X2:',
          0: '14-3/8',
          1: '14-3/8',
          2: '14-6/8',
          3: '15-1/8',
          4: '14-3/8',
          5: '14-3/8',
          6: '14-6/8',
        },
        {
          name: '后斜X2:',
          0: '14-3/8',
          1: '14-3/8',
          2: '14-6/8',
          3: '15-1/8',
          4: '14-3/8',
          5: '14-3/8',
          6: '14-6/8',
        },
        {
          name: '后平:',
          0: '14-3/8',
          1: '14-3/8',
          2: '14-6/8',
          3: '15-1/8',
          4: '14-3/8',
          5: '14-3/8',
          6: '14-6/8',
        }
      ],
      tableHeader: ['XXS', 'XS', 'S', 'M', 'L', 'XL', 'XXL']
    },
    {
      table: [
        {
          name: '脚上:',
          0: '14-3/8',
          1: '14-3/8',
          2: '14-6/8',
          3: '15-1/8',
          4: '14-3/8',
          5: '14-3/8',
          6: '14-6/8',
        },
        {
          name: '衫身X2:',
          0: '14-3/8',
          1: '14-3/8',
          2: '14-6/8',
          3: '15-1/8',
          4: '14-3/8',
          5: '14-3/8',
          6: '14-6/8',
        }
      ],
      tableHeader: ['XXS', 'XS', 'S', 'M', 'L', 'XL', 'XXL']
    }
  ],
  textList: [
    { value: '内领贴扣用手挑，详细做法如原辩' },
    { value: '全件勾线头底面计勾8-10度，每度不可超过三行，要拉平、顺直★后领膊骨线头不可向后领中收藏线头2个勾膊骨1个勾前幅，夹底线头分上下勾一边向袖骨位，一边向衫身骨位，衫脚、袖口领边膊骨位线' },
    { value: '领贴1x1双层，要过气后再缝，缝松眼行，盖松眼行，盖领时，领贴两边各留2寸不用盖，留出车拉链用，领要斜元顺及分针要缝均匀，领内止口要细，领缝好左右一定要对称' }
  ]
};

export default dataJS;
